Let's first load the dataset

In [1]:
import pandas as pd

In [27]:
df = pd.read_csv('exercises_table.csv')
df

     Name    Ex01_Date    Ex02_Date    Ex03_Date    Ex04_Date
0    Ajay  12-Jan-2023  14-Jan-2023  18-Jan-2023  16-Jan-2023
1  Chetan  17-Jan-2023  18-Jan-2023  19-Jan-2023          NaN
2  Girish  17-Jan-2023          NaN  15-Jan-2023          NaN
3   Mohan  19-Jan-2023          NaN          NaN          NaN
4  Vishal  14-Jan-2023  15-Jan-2023  17-Jan-2023  18-Jan-2023

Let's make the "Name" column as the index, so that we can now identify each row by the name of the student

In [28]:
df.set_index('Name', inplace=True)
df

          Ex01_Date    Ex02_Date    Ex03_Date    Ex04_Date
Name
Ajay    12-Jan-2023  14-Jan-2023  18-Jan-2023  16-Jan-2023
Chetan  17-Jan-2023  18-Jan-2023  19-Jan-2023          NaN
Girish  17-Jan-2023          NaN  15-Jan-2023          NaN
Mohan   19-Jan-2023          NaN          NaN          NaN
Vishal  14-Jan-2023  15-Jan-2023  17-Jan-2023  18-Jan-2023

One neat trick ( more of a hack though ) to remove the name for the Row index called as "Name" is to set it's name attribute to None

In [29]:
df.index.name = None
df

          Ex01_Date    Ex02_Date    Ex03_Date    Ex04_Date
Ajay    12-Jan-2023  14-Jan-2023  18-Jan-2023  16-Jan-2023
Chetan  17-Jan-2023  18-Jan-2023  19-Jan-2023          NaN
Girish  17-Jan-2023          NaN  15-Jan-2023          NaN
Mohan   19-Jan-2023          NaN          NaN          NaN
Vishal  14-Jan-2023  15-Jan-2023  17-Jan-2023  18-Jan-2023

How can we find out the students and exercises that were submitted on 18-Jan-2023 and 19-Jan-2023 ?

Let's start by defining the required dates in a list `imp_dates`

In [ ]:
imp_dates = ['18-Jan-2023', '19-Jan-2023']

Now, we need to check which of the values in `df` contain any of the dates present in `imp_dates`. This can be achieved using `isin` method of DataFrame

This returns a boolean DataFrame with cells that contain any of our values of interest ( any date present in `imp_dates` ) having `True` and the rest as `False`

In [56]:
df.isin(imp_dates)

        Ex01_Date  Ex02_Date  Ex03_Date  Ex04_Date
Ajay        False      False       True      False
Chetan      False       True       True      False
Girish      False      False      False      False
Mohan        True      False      False      False
Vishal      False      False      False       True

Let's highlight the cells that contain `True` value using `style` method of DataFrame

In [30]:
(df.isin(imp_dates)
.style
.applymap(lambda x: 'background-color:bisque' 
              if x else '')
)

Compare these with the original values of `df` to verify if the results are right

Our values of interest are present in the highligthed cells below

Now, to filter the rows that contain these dates, we use the values present in the Boolean DataFrame

Let's sum up all the boolean values along each row using `sum(axis=1)`

**Note:** Using `sum()` by default sums the boolean values along each column

In [31]:
df.isin(imp_dates).sum()

Ex01_Date    1
Ex02_Date    1
Ex03_Date    2
Ex04_Date    1
dtype: int64

Summing the values along each row

In [32]:
df.isin(imp_dates).sum(axis=1)

Ajay      1
Chetan    2
Girish    0
Mohan     1
Vishal    1
dtype: int64

We are interested in only those rows that contain atleast one match. So, the sum value for such rows would be > 0

Let's create a mask of the boolean Series for the above comparison

In [33]:
mask_1819 = df.isin(imp_dates).sum(axis=1) > 0
mask_1819

Ajay       True
Chetan     True
Girish    False
Mohan      True
Vishal     True
dtype: bool

Now, let's use the mask to filter the values in the DataFrame

In [34]:
df[mask_1819]

          Ex01_Date    Ex02_Date    Ex03_Date    Ex04_Date
Ajay    12-Jan-2023  14-Jan-2023  18-Jan-2023  16-Jan-2023
Chetan  17-Jan-2023  18-Jan-2023  19-Jan-2023          NaN
Mohan   19-Jan-2023          NaN          NaN          NaN
Vishal  14-Jan-2023  15-Jan-2023  17-Jan-2023  18-Jan-2023

Compare the result with the highlighted values from the original DataFrame shown below

In [41]:
df.isna().sum(axis=1)

Ajay      0
Chetan    1
Girish    2
Mohan     3
Vishal    0
dtype: int64

In [42]:
df.isna().sum(axis=1) > 0

Ajay      False
Chetan     True
Girish     True
Mohan      True
Vishal    False
dtype: bool

In [44]:
df_pending = df[df.isna().sum(axis=1) > 0]
df_pending

          Ex01_Date    Ex02_Date    Ex03_Date Ex04_Date
Chetan  17-Jan-2023  18-Jan-2023  19-Jan-2023       NaN
Girish  17-Jan-2023          NaN  15-Jan-2023       NaN
Mohan   19-Jan-2023          NaN          NaN       NaN

In [45]:
df_pending.style.highlight_null('bisque')

In [48]:
n_rows, n_cols = df_pending.shape
n_rows

3

In [50]:
df_pending.index

Index(['Chetan', 'Girish', 'Mohan'], dtype='object')

In [52]:
bg_color = [{'selector': 'th', 'props': 'background-color: bisque'}]
label_colors = [bg_color] * n_rows
df_pending.style.set_table_styles(dict(zip(df_pending.index, label_colors)), axis=1)

In [53]:
df.style.set_table_styles(dict(zip(df_pending.index, label_colors)), axis=1)

- dummy

In [39]:
(df
.style
.applymap(lambda x: 'background-color:bisque' 
              if x in imp_dates else None)
)